# Triangle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..Triangle Property
Mesh Class See Also
---
Retrieves a specific triangle.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MeshTriangle this[
	int idx
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Triangle ( _
	idx As Integer _
) As MeshTriangle
	Get
```

Visual C++
---
```text
public:
property MeshTriangle^ Triangle[int idx] {
	MeshTriangle^ get (int idx);
}
```

# ### Parameters
idx
    Type: System..::..Int32Index of the triangle, must be in [0, NumTriangles).
# See Also
Mesh Class
Autodesk.Revit.DB Namespace